docs: added mermaid diagrams' '
